================================================================================
Empty array literal
================================================================================

arr := []

--------------------------------------------------------------------------------

(source_file
  (identifier)
  (operator)
  (array_literal))

================================================================================
Simple array literal
================================================================================

arr := [1, 2, 3]

--------------------------------------------------------------------------------

(source_file
  (identifier)
  (operator)
  (array_literal
    (number)
    (number)
    (number)))

================================================================================
Array with strings
================================================================================

arr := ["a", "b", "c"]

--------------------------------------------------------------------------------

(source_file
  (identifier)
  (operator)
  (array_literal
    (string)
    (string)
    (string)))

================================================================================
Nested array
================================================================================

arr := [[1, 2], [3, 4]]

--------------------------------------------------------------------------------

(source_file
  (identifier)
  (operator)
  (array_literal
    (array_literal
      (number)
      (number))
    (array_literal
      (number)
      (number))))

================================================================================
Array access
================================================================================

x := arr[1]

--------------------------------------------------------------------------------

(source_file
  (identifier)
  (operator)
  (index_expression
    object: (identifier)
    index: (number)))

================================================================================
Nested array access
================================================================================

x := arr[1][2]

--------------------------------------------------------------------------------

(source_file
  (identifier)
  (operator)
  (index_expression
    object: (index_expression
      object: (identifier)
      index: (number))
    index: (number)))

================================================================================
Member with array access
================================================================================

x := obj.items[0]

--------------------------------------------------------------------------------

(source_file
  (identifier)
  (operator)
  (index_expression
    object: (member_expression
      object: (identifier)
      property: (identifier))
    index: (number)))
