================================================================================
Empty array literal
================================================================================

arr := []

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (array_literal)))

================================================================================
Simple array literal
================================================================================

arr := [1, 2, 3]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (array_literal
      (number)
      (number)
      (number))))

================================================================================
Array with strings
================================================================================

arr := ["a", "b", "c"]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (array_literal
      (string)
      (string)
      (string))))

================================================================================
Nested array
================================================================================

arr := [[1, 2], [3, 4]]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (array_literal
      (array_literal
        (number)
        (number))
      (array_literal
        (number)
        (number)))))

================================================================================
Array access
================================================================================

x := arr[1]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (index_expression
      object: (identifier)
      index: (number))))

================================================================================
Nested array access
================================================================================

x := arr[1][2]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (index_expression
      object: (index_expression
        object: (identifier)
        index: (number))
      index: (number))))

================================================================================
Member with array access
================================================================================

x := obj.items[0]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (index_expression
      object: (member_expression
        object: (identifier)
        property: (identifier))
      index: (number))))

================================================================================
this_expression with index access
================================================================================

x := this["key"]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (index_expression
      object: (this_expression)
      index: (string))))

================================================================================
base_expression with index access
================================================================================

x := base["key"]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (index_expression
      object: (base_expression)
      index: (string))))

================================================================================
this_expression with dynamic index
================================================================================

x := this["_" . prop]

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (index_expression
      object: (this_expression)
      index: (binary_expression
        left: (string)
        right: (identifier)))))
