================================================================================
Simple class definition
================================================================================

class MyClass {
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body)))

================================================================================
Class with inheritance
================================================================================

class Child extends Parent {
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    parent: (identifier)
    body: (class_body)))

================================================================================
Class with method
================================================================================

class MyClass {
    DoSomething() {
    }
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body
      (class_member
        (method_definition
          name: (identifier))))))

================================================================================
Class with constructor
================================================================================

class MyClass {
    __New() {
    }
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body
      (class_member
        (method_definition
          name: (identifier))))))

================================================================================
Class with property and initializer
================================================================================

class MyClass {
    value := 10
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body
      (class_member
        (class_property
          name: (identifier)
          value: (number))))))

================================================================================
Class with bare property (no initializer)
================================================================================

class MyClass {
    bar
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body
      (class_member
        (class_property
          name: (identifier))))))

================================================================================
Class with static method
================================================================================

class MyClass {
    static GetInstance() {
    }
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body
      (class_member
        (method_definition
          name: (identifier))))))

================================================================================
Class with static property
================================================================================

class MyClass {
    static count := 0
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body
      (class_member
        (class_property
          name: (identifier)
          value: (number))))))

================================================================================
Nested class
================================================================================

class Outer {
    class Inner {
    }
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body
      (class_member
        (class_definition
          name: (identifier)
          body: (class_body))))))

================================================================================
Method with parameters
================================================================================

class MyClass {
    Add(a, b) {
    }
}

--------------------------------------------------------------------------------

(source_file
  (class_definition
    name: (identifier)
    body: (class_body
      (class_member
        (method_definition
          name: (identifier)
          (parameter_list
            (parameter
              (identifier))
            (parameter
              (identifier))))))))

================================================================================
this in member expression
================================================================================

this.value

--------------------------------------------------------------------------------

(source_file
  (member_expression
    object: (this_expression)
    property: (identifier)))

================================================================================
this in method call
================================================================================

this.DoWork()

--------------------------------------------------------------------------------

(source_file
  (method_call
    object: (this_expression)
    method: (identifier)))

================================================================================
base in method call
================================================================================

base.__New()

--------------------------------------------------------------------------------

(source_file
  (method_call
    object: (base_expression)
    method: (identifier)))

================================================================================
Chained this expression
================================================================================

this.data.value

--------------------------------------------------------------------------------

(source_file
  (member_expression
    object: (member_expression
      object: (this_expression)
      property: (identifier))
    property: (identifier)))
