================================================================================
Simple MsgBox command
================================================================================

MsgBox, Hello

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier))))

================================================================================
MsgBox with string
================================================================================

MsgBox, "Hello World"

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (string))))

================================================================================
Command with variable reference
================================================================================

MsgBox, %myVar%

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (variable_ref
        (identifier)))))

================================================================================
Command with builtin variable reference
================================================================================

MsgBox, %A_ScriptDir%

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (variable_ref
        (identifier)))))

================================================================================
Send command
================================================================================

Send, {Enter}

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier))))

================================================================================
Sleep command
================================================================================

Sleep, 1000

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (number))))

================================================================================
Run command
================================================================================

Run, notepad.exe

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier))))

================================================================================
SetTimer command
================================================================================

SetTimer, MyLabel

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier))))

================================================================================
Gosub keyword form
================================================================================

gosub, MyLabel

--------------------------------------------------------------------------------

(source_file
  (keyword)
  (identifier))

================================================================================
Gui command with colon-pair in arguments
================================================================================

Gui, MyGui:Add, Text

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (gui_action
        gui_name: (identifier)
        action: (identifier))
      (identifier))))

================================================================================
Gui command with multiple colon-pairs
================================================================================

Gui, MyGui:Add, Text, x10 y20

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (gui_action
        gui_name: (identifier)
        action: (identifier))
      (identifier)
      (identifier)
      (identifier))))

================================================================================
Gui command with ternary expression in arguments
================================================================================

Gui, MyGui:Add, Text, % x ? "A" : "B"

--------------------------------------------------------------------------------

; NOTE: This test shows a known limitation - force expression syntax (% expr)
; is not currently supported in structured command_arguments
; The ternary expression is parsed as separate top-level tokens
(source_file
  (command
    name: (identifier)
    (command_arguments
      (gui_action
        gui_name: (identifier)
        action: (identifier))
      (identifier)
      (variable_ref
        (identifier))))
  (operator)
  (string)
  (ERROR)
  (string))

================================================================================
StringReplace command
================================================================================

StringReplace, var_2, var, _2,, All

--------------------------------------------------------------------------------

; NOTE: This test shows a known limitation - empty arguments (double comma ,,)
; cause command_arguments parsing to terminate early
; The final argument " All" is parsed as a separate top-level identifier
(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier)
      (identifier)))
  (identifier))

================================================================================
IfInString command
================================================================================

IfInString, var, _2

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier))))

================================================================================
StringLeft command
================================================================================

StringLeft, output, input, 5

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier)
      (number))))

================================================================================
StringMid command
================================================================================

StringMid, output, input, 3, 5

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier)
      (number)
      (number))))

================================================================================
StringLower command
================================================================================

StringLower, output, input

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier))))

================================================================================
GuiControl command
================================================================================

GuiControl, Text, Hello

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier))))

================================================================================
ControlGetText command
================================================================================

ControlGetText, text, Edit1, ahk_class Notepad

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier)
      (identifier)
      (identifier))))

================================================================================
FileReadLine command
================================================================================

FileReadLine, line, myfile.txt, 1

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier)
      (identifier)
      (number))))

================================================================================
IfExist command
================================================================================

IfExist, C:\myfile.txt

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (drive_letter)
      (identifier)
      (identifier))))

================================================================================
IfWinActive command
================================================================================

IfWinActive, ahk_class Notepad

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier))))

================================================================================
MouseClick command
================================================================================

MouseClick, left, 100, 200

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (number)
      (number))))

================================================================================
SoundPlay command
================================================================================

SoundPlay, %A_WinDir%\Media\ding.wav

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (variable_ref
        (identifier))
      (identifier)
      (identifier)
      (identifier))))

================================================================================
Process command
================================================================================

Process, Exist, notepad.exe

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier)
      (identifier))))

================================================================================
SetTitleMatchMode command
================================================================================

SetTitleMatchMode, 2

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (number))))

================================================================================
WinGetTitle command
================================================================================

WinGetTitle, title, A

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier))))

================================================================================
DriveGet command with drive letter
================================================================================

DriveGet, userSerial, Serial, C:

--------------------------------------------------------------------------------

(source_file
  (command
    name: (identifier)
    (command_arguments
      (identifier)
      (identifier)
      (drive_letter))))
