================================================================================
Simple MsgBox command
================================================================================

MsgBox, Hello

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
MsgBox with string
================================================================================

MsgBox, "Hello World"

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Command with variable reference
================================================================================

MsgBox, %myVar%

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Command with builtin variable reference
================================================================================

MsgBox, %A_ScriptDir%

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Send command
================================================================================

Send, {Enter}

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Sleep command
================================================================================

Sleep, 1000

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Run command
================================================================================

Run, notepad.exe

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
SetTimer command
================================================================================

SetTimer, MyLabel

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Gosub command
================================================================================

Gosub, MyLabel

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Gui command with colon-pair in arguments
================================================================================

Gui, MyGui:Add, Text

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Gui command with multiple colon-pairs
================================================================================

Gui, MyGui:Add, Text, x10 y20

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))

================================================================================
Gui command with ternary expression in arguments
================================================================================

Gui, MyGui:Add, Text, % x ? "A" : "B"

--------------------------------------------------------------------------------

(source_file
  (command
    name: (command_name)
    (command_arguments)))
