================================================================================
Simple continuation section
================================================================================

var := (
  line one
  line two
)

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (continuation_section)))

================================================================================
Continuation with options
================================================================================

sql := (LTrim
  SELECT *
  FROM users
)

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (continuation_section)))

================================================================================
Continuation with nested parens
================================================================================

query := (
  SELECT (id, name)
  FROM users
)

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (continuation_section)))

================================================================================
Empty continuation
================================================================================

empty := (
)

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (continuation_section)))
