================================================================================
Simple function definition
================================================================================

MyFunc() {
}

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)))

================================================================================
Function with parameter
================================================================================

MyFunc(x) {
}

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)
    (parameter_list
      (parameter
        (identifier)))))

================================================================================
Function with multiple parameters
================================================================================

MyFunc(x, y, z) {
}

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)
    (parameter_list
      (parameter
        (identifier))
      (parameter
        (identifier))
      (parameter
        (identifier)))))

================================================================================
Function with default parameter
================================================================================

MyFunc(x := 10) {
}

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)
    (parameter_list
      (parameter
        (identifier)
        (number)))))

================================================================================
Function with body
================================================================================

MyFunc() {
  x := 1
  return
}

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)
    body: (block
      (assignment_expression
        left: (identifier)
        right: (number))
      (return_statement))))

================================================================================
Simple function call
================================================================================

MyFunc()

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)))

================================================================================
Function call with argument
================================================================================

MyFunc(42)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (argument_list
      (number))))

================================================================================
Function call with multiple arguments
================================================================================

MyFunc(1, "hello", x)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (argument_list
      (number)
      (string)
      (identifier))))

================================================================================
Nested function calls
================================================================================

Outer(Inner(x))

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (argument_list
      (function_call
        name: (identifier)
        (argument_list
          (identifier))))))

================================================================================
Function call with assignment-like argument
================================================================================

MyFunc(x := 10)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (argument_list
      (assignment_expression
        left: (identifier)
        right: (number)))))
