================================================================================
Simple label
================================================================================

MyLabel:

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier)))

================================================================================
Label with code after
================================================================================

Start:
x := 1

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (assignment_expression
    left: (identifier)
    right: (number)))

================================================================================
Multiple labels
================================================================================

First:
Second:
Third:

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (label
    name: (identifier))
  (label
    name: (identifier)))

================================================================================
Label with comment
================================================================================

MyLabel: ; this is a comment

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (comment))

================================================================================
Colon followed by identifier is gui_action (not a label)
================================================================================

MyGui:Add

--------------------------------------------------------------------------------

(source_file
  (gui_action
    gui_name: (identifier)
    action: (identifier)))

================================================================================
Colon followed by non-identifier is a label (not gui_action)
================================================================================

MyGui:-Caption

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (operator)
  (identifier))
