================================================================================
Simple label
================================================================================

MyLabel:

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier)))

================================================================================
Label with code after
================================================================================

Start:
x := 1

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (assignment_expression
    left: (identifier)
    right: (number)))

================================================================================
Multiple labels
================================================================================

First:
Second:
Third:

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (label
    name: (identifier))
  (label
    name: (identifier)))

================================================================================
Label with comment
================================================================================

MyLabel: ; this is a comment

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (comment))

================================================================================
Colon followed by identifier is gui_action (not a label)
================================================================================

MyGui:Add

--------------------------------------------------------------------------------

(source_file
  (gui_action
    gui_name: (identifier)
    action: (identifier)))

================================================================================
Colon followed by +/- is gui_options (not a label)
================================================================================

MyGui:-Caption

--------------------------------------------------------------------------------

(source_file
  (gui_options)
  (identifier))

================================================================================
Single letter followed by colon is drive_letter (not a label)
================================================================================

C:

--------------------------------------------------------------------------------

(source_file
  (drive_letter))

================================================================================
Drive letter with content after
================================================================================

C:
D:
E:

--------------------------------------------------------------------------------

(source_file
  (drive_letter)
  (drive_letter)
  (drive_letter))

================================================================================
Multi-letter identifier followed by colon is still label
================================================================================

CD:

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier)))
