================================================================================
Simple label
================================================================================

MyLabel:

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier)))

================================================================================
Label with code after
================================================================================

Start:
x := 1

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (assignment_expression
    left: (identifier)
    right: (number)))

================================================================================
Multiple labels
================================================================================

First:
Second:
Third:

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (label
    name: (identifier))
  (label
    name: (identifier)))

================================================================================
Label with comment
================================================================================

MyLabel: ; this is a comment

--------------------------------------------------------------------------------

(source_file
  (label
    name: (identifier))
  (comment))

================================================================================
Colon followed by identifier is not a label
================================================================================

MyGui:Add

--------------------------------------------------------------------------------

(source_file)
