================================================================================
Empty object literal
================================================================================

obj := {}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal)))

================================================================================
Object with single property
================================================================================

obj := {name: "test"}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal
      (object_property
        key: (identifier)
        value: (string)))))

================================================================================
Object with multiple properties
================================================================================

obj := {name: "test", value: 42}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal
      (object_property
        key: (identifier)
        value: (string))
      (object_property
        key: (identifier)
        value: (number)))))

================================================================================
Object with string keys
================================================================================

obj := {"my-key": 1, "another": 2}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal
      (object_property
        key: (string)
        value: (number))
      (object_property
        key: (string)
        value: (number)))))

================================================================================
Object with shorthand property
================================================================================

obj := {name}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal
      (object_property
        key: (identifier)))))

================================================================================
Nested object literal
================================================================================

obj := {outer: {inner: 1}}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal
      (object_property
        key: (identifier)
        value: (object_literal
          (object_property
            key: (identifier)
            value: (number)))))))

================================================================================
Object with array value
================================================================================

obj := {items: [1, 2, 3]}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal
      (object_property
        key: (identifier)
        value: (array_literal
          (number)
          (number)
          (number))))))

================================================================================
Object with numeric keys
================================================================================

obj := {1: "one", 2: "two"}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal
      (object_property
        key: (number)
        value: (string))
      (object_property
        key: (number)
        value: (string)))))

================================================================================
Object with mixed key types
================================================================================

obj := {1: "one", "two": 2, name: "test"}

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (object_literal
      (object_property
        key: (number)
        value: (string))
      (object_property
        key: (string)
        value: (number))
      (object_property
        key: (identifier)
        value: (string)))))

================================================================================
New expression with function call
================================================================================

instance := new MyClass()

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (new_expression
      class: (identifier))))

================================================================================
New expression with arguments
================================================================================

obj := new ClassName(arg1, arg2)

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (new_expression
      class: (identifier)
      arguments: (argument_list
        (identifier)
        (identifier)))))

================================================================================
New expression with member expression
================================================================================

obj := new Namespace.ClassName()

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (new_expression
      class: (member_expression
        object: (identifier)
        property: (identifier)))))
