================================================================================
Simple string
================================================================================

msg := "hello"

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (string)))

================================================================================
String with newline escape
================================================================================

msg := "Hello`nWorld"

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (string
      (escape_sequence))))

================================================================================
String with multiple escapes
================================================================================

msg := "col1`tcol2`tcol3"

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (string
      (escape_sequence)
      (escape_sequence))))

================================================================================
String with escaped backtick
================================================================================

path := "C:``temp``file"

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (string
      (escape_sequence)
      (escape_sequence))))

================================================================================
String with escaped quote
================================================================================

msg := "She said `"Hello`""

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (string
      (escape_sequence)
      (escape_sequence))))

================================================================================
Single quoted string with escape
================================================================================

msg := 'line1`nline2'

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (string
      (escape_sequence))))

================================================================================
String with carriage return escape
================================================================================

msg := "line1`rline2"

--------------------------------------------------------------------------------

(source_file
  (assignment_expression
    left: (identifier)
    right: (string
      (escape_sequence))))
